{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 170, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"name": "convolution2d_5", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"name": "convolution2d_6", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"name": "convolution2d_7", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"name": "convolution2d_8", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "maxpooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "c1", "class_name": "Dense", "config": {"name": "c1", "trainable": true, "output_dim": 36, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1536}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "c2", "class_name": "Dense", "config": {"name": "c2", "trainable": true, "output_dim": 36, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1536}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "c3", "class_name": "Dense", "config": {"name": "c3", "trainable": true, "output_dim": 36, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1536}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "c4", "class_name": "Dense", "config": {"name": "c4", "trainable": true, "output_dim": 36, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1536}, "inbound_nodes": [[["dropout_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["c1", 0, 0], ["c2", 0, 0], ["c3", 0, 0], ["c4", 0, 0]]}, "keras_version": "1.2.2"}